app/controllers/articals_controller.rb

SELECT "articals".* FROM "articals"
---
    def index
        @artical= Artical.all

INSERT INTO "articals" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "xsacxsaxasx"], ["description", "Description is too short (minimum is 15 characters)"], ["created_at", "2000-01-01 00:51:01.183899"], ["updated_at", "2000-01-01 00:51:01.183899"]]
---
    def create
        # render plain: params[:artical]
        # @artical.new(params.require(:artical).permit(:title, :description))
        @artical = Artical.new(artical_params)
        # render plain: @artical.inspect
        if @artical.save

UPDATE "articals" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articals"."id" = ?  [["title", "edit 2- firs"], ["description", "Title is too long (maximum is 20 characters) Title is too long (maximum is 20 characters)"], ["updated_at", "2000-01-01 15:44:27.919521"], ["id", 1]]
---
    def update
        # @artical = Artical.find(params[:id])
        # if @artical.update(params.require(:artical).permit(:title, :description))
        if @artical.update(artical_params)

DELETE FROM "articals" WHERE "articals"."id" = ?  [["id", 1]]
---
    def destroy
        # @artical = Artical.find(params[:id])
        @artical.destroy

SELECT "articals".* FROM "articals" WHERE "articals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_articals
        @artical = Artical.find(params[:id])